In [14]:
from pydataset import data
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [15]:
data = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(data)

In [16]:
df.columns = ['a', 'b', 'c']

In [17]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [18]:
df = pd.DataFrame(data, columns=['a', 'b', 'c'])

In [19]:
df

   a  b  c
0  1  2  3
1  4  5  6

In [20]:
from env import host, user, password

In [31]:
db_name = "employees"

In [32]:
url = f"mysql+pymysql://{user}:{password}@{host}/{db_name}"

In [33]:
df = pd.read_sql("SELECT * FROM employees LIMIT 5", url)

In [34]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [43]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})
df

       name  math  english  reading classroom
0     Sally    62       85       80         A
1      Jane    88       79       67         B
2     Suzie    94       74       95         A
3     Billy    98       96       88         B
4       Ada    77       92       98         A
5      John    79       76       93         B
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
10    Isaac    92       99       93         B
11     Alan    92       62       72         A

In [41]:
df.groupby("classroom").reading.median()

classroom
A    88.5
B    90.5
Name: reading, dtype: float64

In [42]:
df.groupby("classroom").reading.describe()

           count    mean        std   min    25%   50%    75%   max
classroom
A            8.0  87.125   8.887190  72.0  80.75  88.5  94.25  98.0
B            4.0  85.250  12.392874  67.0  82.75  90.5  93.00  93.0

In [45]:
for x in df.groupby("classroom"):
    print(x)

('A',        name  math  english  reading classroom
0     Sally    62       85       80         A
2     Suzie    94       74       95         A
4       Ada    77       92       98         A
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
11     Alan    92       62       72         A)
('B',      name  math  english  reading classroom
1    Jane    88       79       67         B
3   Billy    98       96       88         B
5    John    79       76       93         B
10  Isaac    92       99       93         B)